function [N,D,Iter,Pc,Pm,d1,d2,q,c1,t,e,g,cIndex,mIndex] = data
d1=[153 147 150;
    94  97  130;
    182 198 240];  %厂商到运输中心不同运输方式下的距离

d2=[48	45	39	62	81	165	192 150	189	114	156	0	 120  150;
    162	87	105	60	42	45	81  57	99	72	114	120  0	  84;
    201	141	123	93	108	93	69  33	45	39	39	150	 84	  0];  %运输中心到销售中心的距离

q = [605 622 523 571 643 640 580 643 692 573 526 1527 1394 1645];  % 销售点需求量
c1 = [0.8 0.4 0.2];   %公路  铁路  水路
e = [0.056 0.017 0.013];  %不同运输方式下每公里排碳量  单位：千克/吨公里
g = 100;  %运输中心的运输费用 单位：元/吨

cIndex = 0.5;  %成本模糊隶属度
mIndex = 0.5;  %碳排放模糊隶属度
t = [0.3 0.4 0.3];  %运输方式的比例

%种群大小
N = 200;

%种群个体数
D = size(d2,2);

%迭代次数
Iter = 800;

%交叉率
Pc = 0.8;

%变异率
Pm = 0.15;
end
